ИнтеграцииПримеры_работы/src/InformationRegisters/ЦеныТоваров/ЦеныТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныТоваров</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИнтеграцииПримеры_работы/src/HTTPServices/ЦеныТоваров/Module.bsl
Функция ПолучитьЦеныGET(Запрос)

	Попытка
//		Получить параметр датаиз запроса
		ДатаЗапроса = Запрос.ПараметрыURL.Получить("Дата");
		Если ДатаЗапроса = Null Тогда
			Ответ = Новый HTTPСервисОтвет(400);
			Ответ.УстановитьТелоИзСтроки("No param Date in query");
			Ответ.Заголовки.Вставить("Conten-type", "application/json; charset=utf-8");
			Возврат Ответ;
		КонецЕсли;

		ЦеныНаДату = Дата(ДатаЗапроса);
		
//		Запрос к регистру
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныТоваровСрезПоследних.Период,
		|	ЦеныТоваровСрезПоследних.Товар,
		|	ЦеныТоваровСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныТоваров.СрезПоследних(&ЦеныНаДату,) КАК ЦеныТоваровСрезПоследних";

		Запрос.УстановитьПараметр("ЦеныНаДату", ЦеныНаДату);

		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();

		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		Запись.ЗаписатьНачалоОбъекта();

		Пока Выборка.Следующий() Цикл
			Запись.ЗаписатьИмяСвойства(Строка(Выборка.Товар));
			Запись.ЗаписатьНачалоОбъекта();
			Запись.ЗаписатьИмяСвойства("Период");
			Запись.ЗаписатьЗначение(Строка(Выборка.Период));
			Запись.ЗаписатьИмяСвойства("Цена");
			Запись.ЗаписатьЗначение(Выборка.Цена);
			Запись.ЗаписатьКонецОбъекта();
		КонецЦикла;
		Запись.ЗаписатьКонецОбъекта();
		
//		Записать результат в JSON
		Результат = Запись.Закрыть();
		
//		Формируем ответ
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки(Результат);

	Исключение
//		Вывести информацию об исключении
		Ответ = Новый HTTPСервисОтвет(500);
		Информация = ИнформацияОбОшибке();
		Сообщение = Информация.Описание;
		Если Информация.Причина <> Неопределено Тогда
			Сообщение = Сообщение + ":" + Информация.Причина.Описание;
		КонецЕсли;
		Ответ.УстановитьТелоИзСтроки(Сообщение);

	КонецПопытки;

	Ответ.Заголовки.Вставить("Conten-type", "application/json; charset=utf-8");
	Возврат Ответ;

КонецФункции

Функция ПоказатьЦенуТовараGET(Запрос)

	Попытка
		//Получить параметр код из запроса URL
		Код = Запрос.ПараметрыURL.Получить("Код");
		Если Код = Неопределено Тогда
			Ответ = Новый HTTPСервисОтвет(400);
			Ответ.УстановитьТелоИзСтроки("Code not input");
			Ответ.Заголовки.Вставить("Conten-type", "application/json; charset=utf-8");
			Возврат Ответ;
		КонецЕсли;
		
//		Поиск цены товара по коду
		Запрос_ = Новый Запрос;
		Запрос_.Текст =
		"ВЫБРАТЬ
		|	ЦеныТоваровСрезПоследних.Товар,
		|	ЦеныТоваровСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныТоваров.СрезПоследних(, Товар.Код = &Код) КАК ЦеныТоваровСрезПоследних";

		Запрос_.УстановитьПараметр("Код", Код);

		РезультатЗапроса = Запрос_.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Ответ = Новый HTTPСервисОтвет(404);
			Ответ.УстановитьТелоИзСтроки("Code not found1254");
			Ответ.Заголовки.Вставить("Conten-type", "application/json; charset=utf-8");
			Возврат Ответ;
		КонецЕсли;

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл
			//		Пишем результат в JSON
			Запись = Новый ЗаписьJSON;
			ПарамеирыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
			Запись.УстановитьСтроку(ПарамеирыЗаписи);

			Запись.ЗаписатьНачалоОбъекта();
			Запись.ЗаписатьИмяСвойства("На: ");
			Запись.ЗаписатьЗначение(Строка(ТекущаяДата()));
			Запись.ЗаписатьИмяСвойства("Товар");
			Запись.ЗаписатьЗначение(Строка(Выборка.Товар));
			Запись.ЗаписатьИмяСвойства("Цена");
			Запись.ЗаписатьЗначение(Строка(Выборка.Цена));
			Запись.ЗаписатьКонецОбъекта();

			Результат = Запись.Закрыть();
		КонецЦикла;

		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки(Результат, КодировкаТекста.UTF8);

	Исключение
//		Вывести информацию об исключении
		Ответ = Новый HTTPСервисОтвет(500);
		Информация = ИнформацияОбОшибке();
		Сообщение = Информация.Описание;
		Если Информация.Причина <> Неопределено Тогда
			Сообщение = Сообщение + ":" + Информация.Причина.Описание;
		КонецЕсли;
		Ответ.УстановитьТелоИзСтроки(Сообщение);
	КонецПопытки;

	Ответ.Заголовки.Вставить("Conten-type", "application/json; charset=utf-8");
	Возврат Ответ;

КонецФункции

Функция ПроиндексироватьЦеныPOST(Запрос)

	Попытка
//		Получить процент из запроса URL
		Процент = Запрос.ПараметрыURL.Получить("Процент");
		Если Процент = Неопределено Тогда
			Ответ = Новый HTTPСервисОтвет(400);
			Ответ.УстановитьТелоИзСтроки("Percent not input");
			Ответ.Заголовки.Вставить("Conten-type", "application/json; charset=utf-8");
			Возврат Ответ;
		КонецЕсли;

		Коэффициент = 1 + Число(Процент) / 100;
		
//		Запрос к регистру	
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныТоваровСрезПоследних.Период,
		|	ЦеныТоваровСрезПоследних.Товар,
		|	ЦеныТоваровСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныТоваров.СрезПоследних КАК ЦеныТоваровСрезПоследних";

		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();
		
//		Пишем в JSON цены
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб);
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку(ПараметрыЗаписи);
		Запись.ЗаписатьНачалоОбъекта();

		Пока Выборка.Следующий() Цикл
			НоваяЦена = Выборка.Цена * Коэффициент;
			Запись.ЗаписатьИмяСвойства(Строка(Выборка.Товар));
			Запись.ЗаписатьНачалоОбъекта();
			Запись.ЗаписатьИмяСвойства("Период");
			Запись.ЗаписатьЗначение(Строка(ТекущаяДата()));
			Запись.ЗаписатьИмяСвойства("Цена");
			Запись.ЗаписатьЗначение(НоваяЦена);
			Запись.ЗаписатьКонецОбъекта();
			
	//		Пишем новые записи в регистр
			ЗаписьРегистра = РегистрыСведений.ЦеныТоваров.СоздатьМенеджерЗаписи();
			ЗаписьРегистра.Период = ТекущаяДата();
			ЗаписьРегистра.Товар = Выборка.Товар;
			ЗаписьРегистра.Цена = НоваяЦена;
			ЗаписьРегистра.Записать();
		КонецЦикла;

		Запись.ЗаписатьКонецОбъекта();

		Результат = Запись.Закрыть();
		
//		Формируем ответ, возвращаемый сервисом
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки(Результат);
	Исключение
		
//		Вывести информацию об исключении
		Ответ = Новый HTTPСервисОтвет(500);
		Информация = ИнформацияОбОшибке();
		Сообщение = Информация.Описание;
		Если Информация.Причина <> Неопределено Тогда
			Сообщение = Сообщение + ":" + Информация.Причина.Описание;
		КонецЕсли;
		Ответ.УстановитьТелоИзСтроки(Сообщение);
	КонецПопытки;

	Ответ.Заголовки.Вставить("Conten-type", "application/json; charset=utf-8");
	Возврат Ответ;

КонецФункции
